Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ПериодыДетализации/Ext/ManagerModule.bsl
Функция ПолучитьНомерЗначения(Значение) Экспорт 
	
	Если Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.День") Тогда
		 Возврат 1;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Неделя") Тогда
		 Возврат 2;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Месяц") Тогда
		 Возврат 3;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Квартал") Тогда
		 Возврат 4;
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.ИА_ПериодыДетализации.Год") Тогда
		 Возврат 5;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
